app/Http/Middleware/Manager.php

    public function handle(Request $request, Closure $next)
    {
            $tokenRecieved=$request->bearerToken();
            if(!empty($tokenRecieved)) {
                $jwtConfig = Configuration::forUnsecuredSigner();
                $tokenId = $jwtConfig->parser()->parse($tokenRecieved)->claims()->get('jti'); //retrieves the id of the token from license manager
                //$tokenId = (new Parser(new JoseEncoder()))->parse($tokenRecieved)->claims()->all()['jti'];//(new Parser(new JoseEncoder()))->parse($tokenRecieved)->claims()->all()['jti'];
                $tokens = new OauthAccessToken();
                $token=json_decode($tokens->where('id',$tokenId)->first());//gets that particluar token details
---
SELECT * FROM `oauth_access_tokens` WHERE `id` = 'b2ebfc320432160fe92ad706e3e385458878ffe2d84b30e643195427ddc9cb3599d5847bf8cc9aa7' LIMIT 1