app/Http/Controllers/Admin/DashboardController.php

select count(*) as aggregate from `afl_products` where `product_status` = '1'
select count(distinct `version_number`) as aggregate from `afu_versions` where `version_status` = '1'
select count(distinct `installation_ip`) as aggregate from `afl_installations`
select count(distinct `installation_ip`) as aggregate from `afu_installations`
select count(distinct `callback_ip`) as aggregate from `afl_callbacks`
select count(distinct `callback_ip`) as aggregate from `afu_callbacks`
select * from `afl_products` where `product_status` = '1' order by `product_date` desc limit 10
select distinct * from `afu_versions` where `version_status` = '1' order by `version_date` desc limit 10
select distinct * from `afl_installations` where `installation_status` = '1' order by `installation_date` desc limit 10
select distinct * from `afu_installations` where `installation_status` = '1' order by `installation_date` desc limit 10
select distinct * from `afl_callbacks` where `callback_status` = '1' order by `callback_date_time` desc limit 10
select distinct * from `afu_callbacks` where `callback_status` = '1' order by `callback_date_time` desc limit 10
select * from `afl_reports` where `report_status` = '1' order by `report_date_time` desc limit 10
select distinct `version_expire_date` from `afu_versions` where `version_status` = '1'
---
    public function dashboard()
    {
        $productscount = AflProducts::where('product_status', '1')->count();
        $versionscount = AfuVersions::where('version_status', '1')->distinct('version_number')->count('version_number');
        $aflinsatallations = AflInstallations::distinct('installation_ip')->count('installation_ip');
        $afuinsatallations = AfuInstallations::distinct('installation_ip')->count('installation_ip');
        $aflcallbacks = AflCallbacks::distinct('callback_ip')->count('callback_ip');
        $afucallbacks = AfuCallbacks::distinct('callback_ip')->count('callback_ip');


        $latestproducts = AflProducts::where('product_status', '1')->orderBy('product_date', 'desc')->take(10)->get();
        $latestversions = AfuVersions::where('version_status', '1')->distinct('version_number')->orderBy('version_date', 'desc')->take(10)->get();
        $afllatestinsatallations = AflInstallations::where('installation_status', '1')->distinct('installation_ip')->orderBy('installation_date', 'desc')->take(10)->get();
        $afulatestnsatallations = AfuInstallations::where('installation_status', '1')->distinct('installation_ip')->orderBy('installation_date', 'desc')->take(10)->get();
        $afllatestcallbacks = AflCallbacks::where('callback_status', '1')->distinct('callback_ip')->orderBy('callback_date_time', 'desc')->take(10)->get();
        $afulatestcallbacks = AfuCallbacks::where('callback_status', '1')->distinct('callback_ip')->orderBy('callback_date_time', 'desc')->take(10)->get();
        $afllatestreports = AflReports::where('report_status', '1')->orderBy('report_date_time', 'desc')->take(10)->get(); //need to check distinct requirement for product_id

        $installations = $aflinsatallations + $afuinsatallations;
        $callbacks = $aflcallbacks + $afucallbacks;

        $currentdate = Carbon\Carbon::now();
        $currentdate = $currentdate->toDateTimeString();
        $versionsexpiredate = AfuVersions::where('version_status', '1')->distinct('version_number')->get('version_expire_date');