app/Http/Controllers/Admin/SettingsController.php

    public function cleanUpSettings(CleanUpSettingRequest $request, $SETTING_ID)
    {
        $cleanup = AflSettings::find($SETTING_ID);
        if (empty($cleanup)) {
            $clean = new AflSettings([
                'DATABASE_CLEANUP_ENABLED' => $request->get('DATABASE_CLEANUP_ENABLED'),
                'DATABASE_CLEANUP_CALLBACKS' => $request->get('DATABASE_CLEANUP_CALLBACKS'),
                'DATABASE_CLEANUP_REPORTS_MAIN' => $request->get('DATABASE_CLEANUP_REPORTS_MAIN'),
                'DATABASE_CLEANUP_REPORTS_SYSTEM' => $request->get('DATABASE_CLEANUP_REPORTS_SYSTEM'),
                'DATABASE_CLEANUP_REPORTS_LICENSES' => $request->get('DATABASE_CLEANUP_REPORTS_LICENSES'),
                'DATABASE_CLEANUP_VERSIONS' => $request->get('DATABASE_CLEANUP_VERSIONS'),
                'DATABASE_CLEANUP_FILES' => $request->get('DATABASE_CLEANUP_FILES'),
            ]);
            $clean->save();

            return successResponse(Lang::get('lang.settings_created'), $clean, 201);
        } else {
            $cleanup->DATABASE_CLEANUP_ENABLED = $request->get('DATABASE_CLEANUP_ENABLED');
            $cleanup->DATABASE_CLEANUP_CALLBACKS = $request->get('DATABASE_CLEANUP_CALLBACKS');
            $cleanup->DATABASE_CLEANUP_REPORTS_MAIN = $request->get('DATABASE_CLEANUP_REPORTS_MAIN');
            $cleanup->DATABASE_CLEANUP_REPORTS_SYSTEM = $request->get('DATABASE_CLEANUP_REPORTS_SYSTEM');
            $cleanup->DATABASE_CLEANUP_REPORTS_LICENSES = $request->get('DATABASE_CLEANUP_REPORTS_LICENSES');
            $cleanup->DATABASE_CLEANUP_VERSIONS = $request->get('DATABASE_CLEANUP_VERSIONS');
            $cleanup->DATABASE_CLEANUP_FILES = $request->get('DATABASE_CLEANUP_FILES');

            $cleanup->save();

            return successResponse(lang::get('lang.settings_updated'), $cleanup, 200);
---
select * from `afl_settings`

    public function show()
    {
        $settings = AflSettings::all();
---
select * from `afl_settings`

    protected function dropDownForSecuritySettings()
    {
        $sets_array = DB::table('afl_settings')->get()->toArray();
---
select * from `afl_settings`

    protected function dropDownForGeneralSettings()
    {
        $sets_array = DB::table('afl_settings')->get()->toArray();
---
select * from `afl_settings`

    protected function dropDownForCleanUpSettings()
    {
        $sets_array = DB::table('afl_settings')->get()->toArray();
---
SELECT * FROM `afl_settings`